{
  "dinosaurs": [
    {
      "id": 1,
      "name": "Tyrannosaurus Rex",
      "scientificName": "Tyrannosaurus rex",
      "era": "Late Cretaceous",
      "period": "68-66 million years ago",
      "location": "North America",
      "length": "12-13 meters",
      "weight": "8,000-14,000 kg",
      "diet": "Carnivore",
      "description": "The most famous dinosaur, T. Rex was one of the largest land carnivores of all time. With massive jaws capable of exerting up to 57,000 newtons of force, it could crush bone with ease. Despite its fearsome reputation, recent studies suggest T. Rex may have been covered in primitive feathers.",
      "funFact": "T. Rex had excellent vision and could see better than a hawk, making it a formidable predator.",
      "emoji": "🦖"
    },
    {
      "id": 2,
      "name": "Triceratops",
      "scientificName": "Triceratops horridus",
      "era": "Late Cretaceous",
      "period": "68-66 million years ago",
      "location": "North America",
      "length": "8-9 meters",
      "weight": "6,000-12,000 kg",
      "diet": "Herbivore",
      "description": "With its three distinctive horns and large bony frill, Triceratops is one of the most recognizable dinosaurs. The frill likely served multiple purposes: defense, display, and temperature regulation. These massive herbivores traveled in herds for protection.",
      "funFact": "A Triceratops frill could grow up to 2 meters wide, making up nearly a third of its entire body length!",
      "emoji": "🦏"
    },
    {
      "id": 3,
      "name": "Velociraptor",
      "scientificName": "Velociraptor mongoliensis",
      "era": "Late Cretaceous",
      "period": "75-71 million years ago",
      "location": "Mongolia, China",
      "length": "2 meters",
      "weight": "15-20 kg",
      "diet": "Carnivore",
      "description": "Contrary to popular media portrayals, Velociraptors were actually quite small - about the size of a turkey. However, they were intelligent pack hunters with a large, sickle-shaped claw on each foot. Recent fossil evidence confirms they had feathers.",
      "funFact": "Velociraptors were actually much smaller than depicted in movies - only about 2 feet tall at the hip!",
      "emoji": "🦅"
    },
    {
      "id": 4,
      "name": "Brachiosaurus",
      "scientificName": "Brachiosaurus altithorax",
      "era": "Late Jurassic",
      "period": "154-153 million years ago",
      "location": "North America",
      "length": "25 meters",
      "weight": "56,000 kg",
      "diet": "Herbivore",
      "description": "One of the tallest dinosaurs, Brachiosaurus had front legs longer than its hind legs, giving it a giraffe-like stance. This massive sauropod could reach vegetation up to 13 meters high. Its large nostrils on top of its head led early paleontologists to believe it was aquatic.",
      "funFact": "Despite its enormous size, Brachiosaurus had a brain the size of a cat's!",
      "emoji": "🦕"
    },
    {
      "id": 5,
      "name": "Stegosaurus",
      "scientificName": "Stegosaurus stenops",
      "era": "Late Jurassic",
      "period": "155-150 million years ago",
      "location": "North America",
      "length": "9 meters",
      "weight": "5,000 kg",
      "diet": "Herbivore",
      "description": "Famous for its distinctive double row of large bony plates along its back and spiked tail, Stegosaurus was a slow-moving herbivore. The plates may have been used for temperature regulation and display. Its tail spikes, called thagomizers, were formidable weapons against predators.",
      "funFact": "Stegosaurus had a brain the size of a walnut, one of the smallest brain-to-body ratios of any dinosaur!",
      "emoji": "🦎"
    },
    {
      "id": 6,
      "name": "Pteranodon",
      "scientificName": "Pteranodon longiceps",
      "era": "Late Cretaceous",
      "period": "86-84 million years ago",
      "location": "North America",
      "length": "6 meter wingspan",
      "weight": "20-25 kg",
      "diet": "Piscivore",
      "description": "Though not technically a dinosaur but a pterosaur, Pteranodon was one of the largest flying reptiles. With its distinctive head crest and toothless beak, it soared over ancient seas hunting fish. Its hollow bones and lightweight build allowed for efficient flight despite its impressive size.",
      "funFact": "Pteranodon's wingspan was larger than a small airplane, yet it weighed less than a large dog!",
      "emoji": "🦇"
    },
    {
      "id": 7,
      "name": "Spinosaurus",
      "scientificName": "Spinosaurus aegyptiacus",
      "era": "Mid Cretaceous",
      "period": "112-93 million years ago",
      "location": "North Africa",
      "length": "15 meters",
      "weight": "7,000-20,000 kg",
      "diet": "Carnivore/Piscivore",
      "description": "The largest known carnivorous dinosaur, Spinosaurus had a distinctive sail-like structure on its back formed by elongated vertebrae. Recent discoveries suggest it was semi-aquatic, spending much of its time in water hunting fish with its crocodile-like snout.",
      "funFact": "Spinosaurus is the only known dinosaur adapted for a semi-aquatic lifestyle, with paddle-like feet and dense bones!",
      "emoji": "🐊"
    },
    {
      "id": 8,
      "name": "Ankylosaurus",
      "scientificName": "Ankylosaurus magniventris",
      "era": "Late Cretaceous",
      "period": "68-66 million years ago",
      "location": "North America",
      "length": "6-8 meters",
      "weight": "4,000-8,000 kg",
      "diet": "Herbivore",
      "description": "Built like a living tank, Ankylosaurus was covered in thick armor plates and had a massive club at the end of its tail. This club could swing with enough force to break bones. Its armor was so effective that even T. Rex would have struggled to penetrate it.",
      "funFact": "Ankylosaurus's tail club could swing at speeds up to 40 mph, delivering a bone-crushing blow!",
      "emoji": "🛡️"
    },
    {
      "id": 9,
      "name": "Diplodocus",
      "scientificName": "Diplodocus longus",
      "era": "Late Jurassic",
      "period": "154-152 million years ago",
      "location": "North America",
      "length": "26 meters",
      "weight": "15,000 kg",
      "diet": "Herbivore",
      "description": "One of the longest dinosaurs ever discovered, Diplodocus had an incredibly long neck and tail. Its whip-like tail may have been used for defense or communication. Despite its massive length, it was relatively lightweight for a sauropod.",
      "funFact": "Diplodocus's tail had over 80 vertebrae and could crack like a whip, potentially creating a sonic boom!",
      "emoji": "🦕"
    },
    {
      "id": 10,
      "name": "Allosaurus",
      "scientificName": "Allosaurus fragilis",
      "era": "Late Jurassic",
      "period": "155-145 million years ago",
      "location": "North America",
      "length": "8-9 meters",
      "weight": "2,000-2,500 kg",
      "diet": "Carnivore",
      "description": "A fearsome predator of the Jurassic period, Allosaurus was one of the largest carnivores of its time. With powerful jaws and sharp teeth, it hunted large herbivorous dinosaurs. Evidence suggests they may have hunted in packs.",
      "funFact": "Allosaurus had uniquely hinged jaws that could open incredibly wide, allowing it to take massive bites!",
      "emoji": "🦖"
    },
    {
      "id": 11,
      "name": "Parasaurolophus",
      "scientificName": "Parasaurolophus walkeri",
      "era": "Late Cretaceous",
      "period": "76-73 million years ago",
      "location": "North America",
      "length": "10 meters",
      "weight": "2,500-3,000 kg",
      "diet": "Herbivore",
      "description": "Known for its distinctive long, backward-curving crest, Parasaurolophus was a duck-billed dinosaur. The hollow crest may have been used to produce deep, resonating calls for communication. They likely lived in large herds for protection.",
      "funFact": "Parasaurolophus could produce trumpet-like sounds through its elaborate head crest, possibly audible for miles!",
      "emoji": "🦆"
    },
    {
      "id": 12,
      "name": "Carnotaurus",
      "scientificName": "Carnotaurus sastrei",
      "era": "Late Cretaceous",
      "period": "72-69 million years ago",
      "location": "South America",
      "length": "7-8 meters",
      "weight": "1,500-2,000 kg",
      "diet": "Carnivore",
      "description": "Carnotaurus, meaning 'meat-eating bull', had distinctive horns above its eyes. It was one of the fastest large theropods, with powerful legs built for speed. Its tiny arms were even smaller than T. Rex's, making them nearly vestigial.",
      "funFact": "Carnotaurus had the shortest arms relative to body size of any large carnivorous dinosaur!",
      "emoji": "🐂"
    }
  ]
}